## Series

In [1]:
import numpy as np
import pandas as pd
from numpy.random import rand
#from pandas import Series,DataFrame

In [2]:
list_1 = [3.0, 19.0, 112.0, 4731.0]

series_1 = pd.Series(data = list_1)
series_1

0       3.0
1      19.0
2     112.0
3    4731.0
dtype: float64

In [3]:
type(series_1)

pandas.core.series.Series

In [4]:
array_1 = np.array([3.0, 19.0, 112.0, 4731.0])

series_2 = pd.Series(array_1, index = ['A','B','C','D'])
series_2

A       3.0
B      19.0
C     112.0
D    4731.0
dtype: float64

In [5]:
dict_1 = {'A':3,'B':19,'C':112,'D':4731}


series_3 = pd.Series(dict_1)
series_3

A       3
B      19
C     112
D    4731
dtype: int64

In [6]:
series_1[0]

3.0

In [7]:
series_2['A']

3.0

In [8]:
series_2[['A','D']]

A       3.0
D    4731.0
dtype: float64

In [9]:
series_2['B':'D']

B      19.0
C     112.0
D    4731.0
dtype: float64

In [10]:
series_2 > 19

A    False
B    False
C     True
D     True
dtype: bool

In [11]:
series_2[series_2 > 19]

C     112.0
D    4731.0
dtype: float64

In [12]:
series_1[series_1 > 19]

2     112.0
3    4731.0
dtype: float64

In [13]:
series_1[series_1 > 19] = series_1 / 2
series_1

0       3.0
1      19.0
2      56.0
3    2365.5
dtype: float64

In [14]:
series_2.values

array([3.000e+00, 1.900e+01, 1.120e+02, 4.731e+03])

In [15]:
series_2.index

Index(['A', 'B', 'C', 'D'], dtype='object')

In [16]:
series_2 + series_1

A   NaN
B   NaN
C   NaN
D   NaN
0   NaN
1   NaN
2   NaN
3   NaN
dtype: float64

In [17]:
series_2 + series_3

A       6.0
B      38.0
C     224.0
D    9462.0
dtype: float64

In [74]:
series_4 = pd.Series(list_1, index = ['Z','B','C','F'])
series_4

Z       3.0
B      19.0
C     112.0
F    4731.0
dtype: float64

In [19]:
series_5 = series_3 + series_4
series_5

A      NaN
B     38.0
C    224.0
D      NaN
F      NaN
Z      NaN
dtype: float64

In [ ]:
series_6 = series_2.reindex(['A','B','C','D','E','F'])
series_6

In [ ]:
series_7 = pd.Series(['A','B','C'],index=[1,5,9])
series_7

In [ ]:
series_7.reindex(np.arange(15), method='ffill')

In [75]:
series_4.sort_index()

B      19.0
C     112.0
F    4731.0
Z       3.0
dtype: float64

In [76]:
series_4.sort_values(ascending = False)

F    4731.0
C     112.0
B      19.0
Z       3.0
dtype: float64

In [165]:
print(series_4.drop('Z'))
print(series_4)

B      19
C     112
F    4731
dtype: int64
Z       3
B      19
C     112
F    4731
dtype: int64

In [71]:
series_4.drop('Z', inplace = True)
series_4

B      19.0
C     112.0
F    4731.0
dtype: float64

In [167]:
series_4.drop(['C','F'])

B    19
dtype: int64

## DataFrame

In [20]:
list_2 = [[0,1,2,3],
          [4,5,6,7]]
list_2

[[0, 1, 2, 3], [4, 5, 6, 7]]

In [21]:
df_1 = pd.DataFrame(data = list_2)
df_1

   0  1  2  3
0  0  1  2  3
1  4  5  6  7

In [22]:
type(df_1)

pandas.core.frame.DataFrame

In [23]:
array_2 = np.arange(24).reshape(6,4)
array_2

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19],
       [20, 21, 22, 23]])

In [61]:
df_2 = pd.DataFrame(array_2,
                    index = ['r1','r2','r3','r4','r5','r6'],
                    columns = ['c1','c2','c3','c4'])
df_2

    c1  c2  c3  c4
r1   0   1   2   3
r2   4   5   6   7
r3   8   9  10  11
r4  12  13  14  15
r5  16  17  18  19
r6  20  21  22  23

In [41]:
df_2.loc['r1']

c1    0
c2    1
c3    2
c4    3
Name: r1, dtype: int64

In [42]:
df_2.iloc[0]

c1    0
c2    1
c3    2
c4    3
Name: r1, dtype: int64

In [43]:
df_2.loc[['r1','r4']]

    c1  c2  c3  c4
r1   0   1   2   3
r4  12  13  14  15

In [44]:
df_2.iloc[[0,-1]]

    c1  c2  c3  c4
r1   0   1   2   3
r6  20  21  22  23

In [45]:
df_2.loc['r2','c2']

5

In [46]:
df_2 > 6

       c1     c2     c3     c4
r1  False  False  False  False
r2  False  False  False   True
r3   True   True   True   True
r4   True   True   True   True
r5   True   True   True   True
r6   True   True   True   True

In [47]:
df_2[df_2['c2'] > 15]

    c1  c2  c3  c4
r5  16  17  18  19
r6  20  21  22  23

In [48]:
df_2[(df_2['c2'] > 15) | (df_2['c2'] == 1)]

    c1  c2  c3  c4
r1   0   1   2   3
r5  16  17  18  19
r6  20  21  22  23

In [49]:
new_row_labels = ['r1','r2','r3','r4','r5','r6','r7','r8']

df_3 = df_2.reindex(labels = new_row_labels) # axis = 0
df_3

      c1    c2    c3    c4
r1   0.0   1.0   2.0   3.0
r2   4.0   5.0   6.0   7.0
r3   8.0   9.0  10.0  11.0
r4  12.0  13.0  14.0  15.0
r5  16.0  17.0  18.0  19.0
r6  20.0  21.0  22.0  23.0
r7   NaN   NaN   NaN   NaN
r8   NaN   NaN   NaN   NaN

In [50]:
df_2.reindex(labels = new_row_labels, method = 'ffill')

    c1  c2  c3  c4
r1   0   1   2   3
r2   4   5   6   7
r3   8   9  10  11
r4  12  13  14  15
r5  16  17  18  19
r6  20  21  22  23
r7  20  21  22  23
r8  20  21  22  23

In [51]:
df_2.reindex(labels = new_row_labels, fill_value = 1)

    c1  c2  c3  c4
r1   0   1   2   3
r2   4   5   6   7
r3   8   9  10  11
r4  12  13  14  15
r5  16  17  18  19
r6  20  21  22  23
r7   1   1   1   1
r8   1   1   1   1

In [52]:
new_column_labels = ['c1','c2','c3','c4','c5','c6']

df_4 = df_2.reindex(labels = new_column_labels, axis = 1)
df_4

    c1  c2  c3  c4  c5  c6
r1   0   1   2   3 NaN NaN
r2   4   5   6   7 NaN NaN
r3   8   9  10  11 NaN NaN
r4  12  13  14  15 NaN NaN
r5  16  17  18  19 NaN NaN
r6  20  21  22  23 NaN NaN

In [53]:
df_2.reindex(columns = new_column_labels)

    c1  c2  c3  c4  c5  c6
r1   0   1   2   3 NaN NaN
r2   4   5   6   7 NaN NaN
r3   8   9  10  11 NaN NaN
r4  12  13  14  15 NaN NaN
r5  16  17  18  19 NaN NaN
r6  20  21  22  23 NaN NaN

In [77]:
df_2.sort_index(axis = 0)

    c1  c2  c3  c4
r2   4   5   6   7
r3   8   9  10  11
r4  12  13  14  15
r5  16  17  18  19
r6  20  21  22  23

In [81]:
df_2.sort_index(axis = 1, ascending = False)

    c4  c3  c2  c1
r2   7   6   5   4
r3  11  10   9   8
r4  15  14  13  12
r5  19  18  17  16
r6  23  22  21  20

In [82]:
df_2.sort_values(by = 'c3', ascending = False)

    c1  c2  c3  c4
r6  20  21  22  23
r5  16  17  18  19
r4  12  13  14  15
r3   8   9  10  11
r2   4   5   6   7

In [66]:
print(df_2.drop('c1', axis = 1))
df_2

    c2  c3  c4
r2   5   6   7
r3   9  10  11
r4  13  14  15
r5  17  18  19
r6  21  22  23

    c1  c2  c3  c4
r2   4   5   6   7
r3   8   9  10  11
r4  12  13  14  15
r5  16  17  18  19
r6  20  21  22  23

In [59]:
df_2.drop(columns = 'c1')

    c2  c3  c4
r2   5   6   7
r3   9  10  11
r4  13  14  15
r5  17  18  19
r6  21  22  23

In [64]:
print(df_2.drop('r1', axis = 0))
df_2

    c1  c2  c3  c4
r2   4   5   6   7
r3   8   9  10  11
r4  12  13  14  15
r5  16  17  18  19
r6  20  21  22  23

    c1  c2  c3  c4
r1   0   1   2   3
r2   4   5   6   7
r3   8   9  10  11
r4  12  13  14  15
r5  16  17  18  19
r6  20  21  22  23

In [65]:
df_2.drop(index = 'r1', inplace = True)
df_2

    c1  c2  c3  c4
r2   4   5   6   7
r3   8   9  10  11
r4  12  13  14  15
r5  16  17  18  19
r6  20  21  22  23

In [67]:
df_2.drop(['r5','r6'], axis = 0)

    c1  c2  c3  c4
r2   4   5   6   7
r3   8   9  10  11
r4  12  13  14  15

## NA/NULL

In [83]:
series_5.isnull()

A     True
B    False
C    False
D     True
F     True
Z     True
dtype: bool

In [84]:
series_5[series_5.isnull()]

A   NaN
D   NaN
F   NaN
Z   NaN
dtype: float64

In [85]:
series_5[series_5.notnull()]

B     38.0
C    224.0
dtype: float64

In [90]:
series_5.dropna() # inplace = True

B     38.0
C    224.0
dtype: float64

In [112]:
df_5 = pd.DataFrame([
    [1,np.nan,3],
    [4,np.nan,np.nan],
    [9,7,8],
    [np.nan,np.nan,np.nan]
])
df_5

     0    1    2
0  1.0  NaN  3.0
1  4.0  NaN  NaN
2  9.0  7.0  8.0
3  NaN  NaN  NaN

In [113]:
df_5.dropna()

     0    1    2
2  9.0  7.0  8.0

In [114]:
df_5.dropna(axis = 1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [115]:
df_5.dropna(how = 'all')

     0    1    2
0  1.0  NaN  3.0
1  4.0  NaN  NaN
2  9.0  7.0  8.0

In [117]:
df_5.dropna(thresh = 2) # inplace = True

     0    1    2
0  1.0  NaN  3.0
2  9.0  7.0  8.0

In [119]:
df_5.fillna(value = 0)

     0    1    2
0  1.0  0.0  3.0
1  4.0  0.0  0.0
2  9.0  7.0  8.0
3  0.0  0.0  0.0

In [124]:
print(df_5.mean())
df_5.fillna(value = df_5.mean())

0    4.666667
1    7.000000
2    5.500000
dtype: float64

          0    1    2
0  1.000000  7.0  3.0
1  4.000000  7.0  5.5
2  9.000000  7.0  8.0
3  4.666667  7.0  5.5

In [127]:
df_5[1].fillna(value = df_5[1].mean(), inplace = True)
df_5

     0    1    2
0  1.0  7.0  3.0
1  4.0  7.0  NaN
2  9.0  7.0  8.0
3  NaN  7.0  NaN

## Multi-index

In [130]:
series_6 = pd.Series(rand(6),
                     index=[[1,1,1,2,2,2],['d1','d2','d3','d1','d2','d3']]) 

series_6

1  d1    0.836921
   d2    0.200719
   d3    0.194624
2  d1    0.214548
   d2    0.480915
   d3    0.227146
dtype: float64

In [131]:
series_6.index

MultiIndex([(1, 'd1'),
            (1, 'd2'),
            (1, 'd3'),
            (2, 'd1'),
            (2, 'd2'),
            (2, 'd3')],
           )

In [134]:
series_6[1]

d1    0.836921
d2    0.200719
d3    0.194624
dtype: float64

In [135]:
series_6[1]['d2']

0.2007194198643698

In [146]:
series_6[:,'d2']

1    0.200719
2    0.480915
dtype: float64

In [145]:
series_6[2][['d1','d3']]

d1    0.214548
d3    0.227146
dtype: float64

In [147]:
series_6.unstack()

         d1        d2        d3
1  0.836921  0.200719  0.194624
2  0.214548  0.480915  0.227146

In [187]:
df_6 = pd.DataFrame(
    np.arange(16).reshape(4,4),
    index = [['a','a','b','b'], [1,2,1,2]],
    columns = [['A','A','B','B'], [1,2,1,2]]
) 
df_6

      A       B
      1   2   1   2
a 1   0   1   2   3
  2   4   5   6   7
b 1   8   9  10  11
  2  12  13  14  15

In [176]:
df_6.loc['a']

   A     B
   1  2  1  2
1  0  1  2  3
2  4  5  6  7

In [177]:
df_6.loc['a'].loc[1]

A  1    0
   2    1
B  1    2
   2    3
Name: 1, dtype: int64

In [178]:
df_6.index

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [179]:
df_6.columns

MultiIndex([('A', 1),
            ('A', 2),
            ('B', 1),
            ('B', 2)],
           )

In [188]:
df_6.index.names = ['letter','values'] 
df_6.columns.names = ['LETTER','VALUES']
df_6

LETTER          A       B
VALUES          1   2   1   2
letter values
a      1        0   1   2   3
       2        4   5   6   7
b      1        8   9  10  11
       2       12  13  14  15

In [192]:
df_6.sort_index(axis = 1, level = 'VALUES')

LETTER          A   B   A   B
VALUES          1   1   2   2
letter values
a      1        0   2   1   3
       2        4   6   5   7
b      1        8  10   9  11
       2       12  14  13  15

In [194]:
df_6.sort_index(axis = 0, level = 'values')

LETTER          A       B
VALUES          1   2   1   2
letter values
a      1        0   1   2   3
b      1        8   9  10  11
a      2        4   5   6   7
b      2       12  13  14  15